app/views/movies/_movie.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = 1
SELECT AVG("reviews"."points") FROM "reviews" WHERE "reviews"."movie_id" = 1
---
    <strong>Review average:</strong>
    <%= movie.reviews&.average(:points)&.round(2) %>