app/controllers/actors_controller.rb

  def create
    @actor = Actor.new(actor_params)

    respond_to do |format|
      if @actor.save
---
INSERT INTO "actors" ("name", "birth_date", "height", "weight", "gender", "blood_type", "created_at", "updated_at") VALUES ('', NULL, NULL, NULL, 'cote', 'c', '2025-06-02 07:20:17.110711', '2025-06-02 07:20:17.110711') RETURNING "id"

  def update
    respond_to do |format|
      if @actor.update(actor_params)
---
UPDATE "actors" SET "name" = 'Shinya Kote', "birth_date" = '1973-12-15', "height" = 176, "gender" = 'male', "blood_type" = '', "updated_at" = '2025-06-02 07:41:48.782932' WHERE "actors"."id" = 3

  def destroy
    @actor.destroy!
---
DELETE FROM "actors" WHERE "actors"."id" = 1

    def set_actor
      @actor = Actor.find(params.expect(:id))
---
SELECT "actors".* FROM "actors" WHERE "actors"."id" = 1 LIMIT 1