app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("title", "description", "release_date", "created_at", "updated_at") VALUES ('っっｑ', 'っっｑ', '2025-06-10', '2025-06-23 07:33:24.619791', '2025-06-23 07:33:24.619791') RETURNING "id"

  def update
    respond_to do |format|
      if @movie.update(movie_params)
---
UPDATE "movies" SET "description" = '『怪物』（かいぶつ）は、2023年の日本映画。監督は是枝裕和、脚本は坂元裕二。主演は安藤サクラ、永山瑛太、黒川想矢、柊木陽太。第76回カンヌ国際映画祭において、脚本賞および日本映画史上初のクィア・パルム賞を受賞し、190以上の国や地域でも展開されることが決定した。', "release_date" = '2023-06-02', "updated_at" = '2025-06-16 12:52:42.661221' WHERE "movies"."id" = 1

  def destroy
    @movie.destroy!
---
DELETE FROM "movies" WHERE "movies"."id" = 4

    def set_movie
      @movie = Movie.find(params.expect(:id))
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = 1 LIMIT 1