app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("content", "movie_id", "created_at", "updated_at", "user_id", "points") VALUES ('www', 1, '2025-06-23 08:17:48.300518', '2025-06-23 08:17:48.300518', 2, 1) RETURNING "id"
---
  def create
    @review = Review.new(review_params)
    @review.user = current_user

    if @review.save

UPDATE "reviews" SET "content" = '子役たちの演技が素晴らしい', "updated_at" = '2025-06-16 13:03:26.375321' WHERE "reviews"."id" = 1
---
  def update
  if @review.update(review_params)

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
    def current_user
      Session.find_by(id: cookies.signed[:session_id])&.user